; domain
(define (domain tankyard)
    (:requirements :strips :typing :equality :adl :fluents)
    (:types tank)
  (:predicates
    (idle ?x - tank)
  )

    (:functions
        (level ?c - tank);; - int  ;; The value shown in counter ?c
        (flowrate ?c - tank);;
        (capacity);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action fill
         :parameters (?c - tank)
         :precondition (and (<= (+ (level ?c) (flowrate ?c)) (capacity)))
         :effect (and (increase (level ?c) (flowrate ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action drain
         :parameters (?c - tank)
         :precondition (and (>= (- (level ?c) (flowrate ?c)) 0))
         :effect (and (decrease (level ?c) (flowrate ?c)))
    )

    (:action open_valve
         :parameters (?c - tank)
         :precondition (and (<= (+ (flowrate ?c) 1) 10))
         :effect (and (increase (flowrate ?c) 1))
    )

    (:action close_valve
         :parameters (?c - tank)
         :precondition (and (>= (flowrate ?c) 1))
         :effect (and (decrease (flowrate ?c) 1))
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem tankyard-p03)
	(:domain tankyard)
	(:objects
		tank0 tank1 tank2 - tank
	)
  (:init
		(= (level tank0) 64)
	(= (level tank1) 19)
	(= (level tank2) 77)

        (= (flowrate tank0) 0)
	(= (flowrate tank1) 0)
	(= (flowrate tank2) 0)

		(= (capacity) 100)
	)
	(:goal
		(and
			(<= (+ (level tank0) 1) (level tank1))
	(<= (+ (level tank1) 1) (level tank2))
		)
	)
)

; plan
1. (open_valve tank1)
   changed: (flowrate tank1) from 0 to 1
   goals met: 1 of 2
2. (fill tank1)
   changed: (level tank1) from 19 to 20
   goals met: 1 of 2
3. (fill tank1)
   changed: (level tank1) from 20 to 21
   goals met: 1 of 2
4. (fill tank1)
   changed: (level tank1) from 21 to 22
   goals met: 1 of 2
5. (fill tank1)
   changed: (level tank1) from 22 to 23
   goals met: 1 of 2
6. (fill tank1)
   changed: (level tank1) from 23 to 24
   goals met: 1 of 2
7. (fill tank1)
   changed: (level tank1) from 24 to 25
   goals met: 1 of 2
8. (fill tank1)
   changed: (level tank1) from 25 to 26
   goals met: 1 of 2
9. (fill tank1)
   changed: (level tank1) from 26 to 27
   goals met: 1 of 2
10. (fill tank1)
   changed: (level tank1) from 27 to 28
   goals met: 1 of 2
11. (fill tank1)
   changed: (level tank1) from 28 to 29
   goals met: 1 of 2
12. (fill tank1)
   changed: (level tank1) from 29 to 30
   goals met: 1 of 2
13. (fill tank1)
   changed: (level tank1) from 30 to 31
   goals met: 1 of 2
14. (fill tank1)
   changed: (level tank1) from 31 to 32
   goals met: 1 of 2
15. (fill tank1)
   changed: (level tank1) from 32 to 33
   goals met: 1 of 2
16. (fill tank1)
   changed: (level tank1) from 33 to 34
   goals met: 1 of 2
17. (fill tank1)
   changed: (level tank1) from 34 to 35
   goals met: 1 of 2
18. (fill tank1)
   changed: (level tank1) from 35 to 36
   goals met: 1 of 2
19. (fill tank1)
   changed: (level tank1) from 36 to 37
   goals met: 1 of 2
20. (fill tank1)
   changed: (level tank1) from 37 to 38
   goals met: 1 of 2
21. (fill tank1)
   changed: (level tank1) from 38 to 39
   goals met: 1 of 2
22. (fill tank1)
   changed: (level tank1) from 39 to 40
   goals met: 1 of 2
23. (fill tank1)
   changed: (level tank1) from 40 to 41
   goals met: 1 of 2
24. (fill tank1)
   changed: (level tank1) from 41 to 42
   goals met: 1 of 2
25. (fill tank1)
   changed: (level tank1) from 42 to 43
   goals met: 1 of 2
26. (fill tank1)
   changed: (level tank1) from 43 to 44
   goals met: 1 of 2
27. (fill tank1)
   changed: (level tank1) from 44 to 45
   goals met: 1 of 2
28. (fill tank1)
   changed: (level tank1) from 45 to 46
   goals met: 1 of 2
29. (fill tank1)
   changed: (level tank1) from 46 to 47
   goals met: 1 of 2
30. (fill tank1)
   changed: (level tank1) from 47 to 48
   goals met: 1 of 2
31. (fill tank1)
   changed: (level tank1) from 48 to 49
   goals met: 1 of 2
32. (fill tank1)
   changed: (level tank1) from 49 to 50
   goals met: 1 of 2
33. (fill tank1)
   changed: (level tank1) from 50 to 51
   goals met: 1 of 2
34. (fill tank1)
   changed: (level tank1) from 51 to 52
   goals met: 1 of 2
35. (fill tank1)
   changed: (level tank1) from 52 to 53
   goals met: 1 of 2
36. (fill tank1)
   changed: (level tank1) from 53 to 54
   goals met: 1 of 2
37. (fill tank1)
   changed: (level tank1) from 54 to 55
   goals met: 1 of 2
38. (fill tank1)
   changed: (level tank1) from 55 to 56
   goals met: 1 of 2
39. (fill tank1)
   changed: (level tank1) from 56 to 57
   goals met: 1 of 2
40. (fill tank1)
   changed: (level tank1) from 57 to 58
   goals met: 1 of 2
41. (fill tank1)
   changed: (level tank1) from 58 to 59
   goals met: 1 of 2
42. (fill tank1)
   changed: (level tank1) from 59 to 60
   goals met: 1 of 2
43. (fill tank1)
   changed: (level tank1) from 60 to 61
   goals met: 1 of 2
44. (fill tank1)
   changed: (level tank1) from 61 to 62
   goals met: 1 of 2
45. (fill tank1)
   changed: (level tank1) from 62 to 63
   goals met: 1 of 2
46. (fill tank1)
   changed: (level tank1) from 63 to 64
   goals met: 1 of 2
47. (fill tank1)
   changed: (level tank1) from 64 to 65
   goals met: 2 of 2
